In [2]:
import pandas as pd
import numpy as np

my_df = pd.read_csv(r'C:\Users\harik\Documents\Python_Exercises\Pandas_Basics\Datasets\autos.csv', encoding="utf-8")
# my_df

In [3]:
my_df.index = np.arange(1, len(my_df)+1)

# my_df

In [4]:
my_df.index

Index([     1,      2,      3,      4,      5,      6,      7,      8,      9,
           10,
       ...
       371519, 371520, 371521, 371522, 371523, 371524, 371525, 371526, 371527,
       371528],
      dtype='int32', length=371528)

In [5]:
my_df.columns

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'kilometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

In [6]:
my_df.values

array([['2016-03-24 11:52:17', 'Golf_3_1.6', 'privat', ..., 0, 70435,
        '2016-04-07 03:16:57'],
       ['2016-03-24 10:58:45', 'A5_Sportback_2.7_Tdi', 'privat', ..., 0,
        66954, '2016-04-07 01:46:50'],
       ['2016-03-14 12:52:21', 'Jeep_Grand_Cherokee_"Overland"',
        'privat', ..., 0, 90480, '2016-04-05 12:47:46'],
       ...,
       ['2016-03-19 18:57:12', 'Volkswagen_Multivan_T4_TDI_7DC_UY2',
        'privat', ..., 0, 87439, '2016-04-07 07:15:26'],
       ['2016-03-20 19:41:08', 'VW_Golf_Kombi_1_9l_TDI', 'privat', ...,
        0, 40764, '2016-03-24 12:45:21'],
       ['2016-03-07 19:39:19',
        'BMW_M135i_vollausgestattet_NP_52.720____Euro', 'privat', ..., 0,
        73326, '2016-03-22 03:17:10']], dtype=object)

In [7]:
type(my_df)

pandas.core.frame.DataFrame

In [8]:
type(my_df.index)

pandas.core.indexes.base.Index

In [9]:
type(my_df.columns)

pandas.core.indexes.base.Index

In [10]:
type(my_df.values)

numpy.ndarray

In [11]:
# Column name
# my_df.name
my_df.yearOfRegistration

1         1993
2         2011
3         2004
4         2001
5         2008
          ...
371524    2005
371525    2000
371526    1996
371527    2002
371528    2013
Name: yearOfRegistration, Length: 371528, dtype: int64

In [12]:
type(my_df.yearOfRegistration)

pandas.core.series.Series

In [13]:
my_series1 = pd.Series(my_df['name'])
my_series1

1                                           Golf_3_1.6
2                                 A5_Sportback_2.7_Tdi
3                       Jeep_Grand_Cherokee_"Overland"
4                                   GOLF_4_1_4__3TÜRER
5                       Skoda_Fabia_1.4_TDI_PD_Classic
                              ...
371524                      Suche_t4___vito_ab_6_sitze
371525           Smart_smart_leistungssteigerung_100ps
371526              Volkswagen_Multivan_T4_TDI_7DC_UY2
371527                          VW_Golf_Kombi_1_9l_TDI
371528    BMW_M135i_vollausgestattet_NP_52.720____Euro
Name: name, Length: 371528, dtype: object

In [14]:
my_series = pd.Series(my_df['name'].unique())
my_series

0                                           Golf_3_1.6
1                                 A5_Sportback_2.7_Tdi
2                       Jeep_Grand_Cherokee_"Overland"
3                                   GOLF_4_1_4__3TÜRER
4                       Skoda_Fabia_1.4_TDI_PD_Classic
                              ...
233526                                    turbo_defekt
233527                      Suche_t4___vito_ab_6_sitze
233528           Smart_smart_leistungssteigerung_100ps
233529                          VW_Golf_Kombi_1_9l_TDI
233530    BMW_M135i_vollausgestattet_NP_52.720____Euro
Length: 233531, dtype: object

In [15]:
my_df['name'].value_counts()

name
Ford_Fiesta                                              657
BMW_318i                                                 627
Opel_Corsa                                               622
Volkswagen_Golf_1.4                                      603
BMW_316i                                                 523
                                                        ...
Audi_A4_Avant_Klima_Gruene_Plakette_TÜV_&AU_NEU_XENON      1
Renault_clio_in_gold_450VB_!!                              1
Fiat_Doblo_1.6_Multijet                                    1
Renault_Laguna_1                                           1
BMW_M135i_vollausgestattet_NP_52.720____Euro               1
Name: count, Length: 233531, dtype: int64

In [16]:
my_df.loc[1:3, ['name','seller']]

                             name  seller
1                      Golf_3_1.6  privat
2            A5_Sportback_2.7_Tdi  privat
3  Jeep_Grand_Cherokee_"Overland"  privat

In [17]:
type(my_df.loc[2])

pandas.core.series.Series

In [18]:
my_df.loc[[2,4]]

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
2,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
4,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17

In [19]:
type(my_df.loc[[2,4]])

pandas.core.frame.DataFrame

In [20]:
my_df.iloc[2]

dateCrawled                       2016-03-14 12:52:21
name                   Jeep_Grand_Cherokee_"Overland"
seller                                         privat
offerType                                     Angebot
price                                            9800
abtest                                           test
vehicleType                                       suv
yearOfRegistration                               2004
gearbox                                     automatik
powerPS                                           163
model                                           grand
kilometer                                      125000
monthOfRegistration                                 8
fuelType                                       diesel
brand                                            jeep
notRepairedDamage                                 NaN
dateCreated                       2016-03-14 00:00:00
nrOfPictures                                        0
postalCode                                      90480
lastSeen                          2016-04-05 12:47:46
Name: 3, dtype: object

In [21]:
type(my_df.iloc[2])

pandas.core.series.Series

In [22]:
my_df.iloc[2:4]

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
3,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
4,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17

In [23]:
type(my_df.iloc[2:4])

pandas.core.frame.DataFrame

In [24]:
my_df.iloc[2:5, :3]

           dateCrawled                            name  seller
3  2016-03-14 12:52:21  Jeep_Grand_Cherokee_"Overland"  privat
4  2016-03-17 16:54:04              GOLF_4_1_4__3TÜRER  privat
5  2016-03-31 17:25:20  Skoda_Fabia_1.4_TDI_PD_Classic  privat

In [27]:
my_df.iloc[2:5]

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
3,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
4,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
5,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21

In [26]:
my_df.iloc[:,2:5]

        seller offerType  price
1       privat   Angebot    480
2       privat   Angebot  18300
3       privat   Angebot   9800
4       privat   Angebot   1500
5       privat   Angebot   3600
...        ...       ...    ...
371524  privat   Angebot   2200
371525  privat   Angebot   1199
371526  privat   Angebot   9200
371527  privat   Angebot   3400
371528  privat   Angebot  28990

[371528 rows x 3 columns]

In [30]:
my_df['seller'][1]

'privat'